apache/nuttx/arch/arm/src/imxrt/imxrt_flexspi.c
static void imxrt_flexspi_configure_prefetch(struct flexspi_dev_s *dev,
                                             bool enable)
{
  struct imxrt_flexspidev_s *priv = (struct imxrt_flexspidev_s *)dev;

  imxrt_flexspi_configure_prefetch_private(priv->base, enable);
}

/****************************************************************************
 * Name: imxrt_flexspi_update_lut
 *
 * Description:
 *   Perform FlexSPI LUT table update
 *
 * Input Parameters:
 *   dev     - Device-specific state data
 *   index   - Index start to update
 *   cmd     - Command array
 *   count   - Size of the array
 *
 * Returned Value:
 *   none
 *
 ****************************************************************************/

static void imxrt_flexspi_update_lut(struct flexspi_dev_s *dev,
                                     uint32_t index,
                                     const uint32_t *cmd,
                                     uint32_t count)
{
  struct imxrt_flexspidev_s *priv = (struct imxrt_flexspidev_s *)dev;

  imxrt_flexspi_update_lut_private(priv->base, index, cmd, count);
}

/****************************************************************************
 * Name: imxrt_flexspi_set_device_config
 *
 * Description:
 *   Perform FlexSPI device config
 *
 * Input Parameters:
 *   dev     - Device-specific state data
 *   config  - Config data for external device
 *   port    - Port
 *
 * Returned Value:
 *   none
 *
 ****************************************************************************/

static void imxrt_flexspi_set_device_config(struct flexspi_dev_s *dev,
                                    struct flexspi_device_config_s *config,
                                    enum flexspi_port_e port)
{
  struct imxrt_flexspidev_s *priv = (struct imxrt_flexspidev_s *)dev;

  imxrt_flexspi_set_device_config_private(priv->base, config, port);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_flexspi_initialize
 *
 * Description:
 *   Initialize the selected FlexSPI port in master mode
 *
 * Input Parameters:
 *   intf - Interface number(must be zero)
 *
 * Returned Value:
 *   Valid FlexSPI device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct flexspi_dev_s *imxrt_flexspi_initialize(int intf)
{
  struct imxrt_flexspidev_s *priv;
  struct flexspi_config_s flexspi_config;

  /* The supported i.MXRT parts have only a single FlexSPI port. Other
   * is reserved for code XIP
   */

  DEBUGASSERT(intf >= 0 && intf < 2);

  /* Select the FlexSPI interface */

#ifdef CONFIG_IMXRT_FLEXSPI1
  if (intf == 0)
    {
      /* If this function is called multiple times, the following operations
       * will be performed multiple times.
       */

      /* Select FlexSPI */

      priv = &g_flexspi0dev;

      /* Enable clocking to the FlexSPI peripheral */

      imxrt_clockrun_flexspi();
    }

#endif
#ifdef CONFIG_IMXRT_FLEXSPI2
  if (intf == 1)
    {
      /* If this function is called multiple times, the following operations
       * will be performed multiple times.
       */

      /* Select FlexSPI */

      priv = &g_flexspi1dev;

      /* Enable clocking to the FlexSPI peripheral */

      imxrt_clockrun_flexspi2();
    }

#endif
  else
    {
      return NULL;
    }

  /* Has the FlexSPI hardware been initialized? */

  if (!priv->initialized)
    {
      /* No perform one time initialization */

      /* Perform hardware initialization. Puts the FlexSPI into an active
       * state.
       */

      imxrt_flexspi_get_default_config(&flexspi_config);
      imxrt_flexspi_init(priv->base, &flexspi_config);

      /* Enable interrupts at the NVIC */

      priv->initialized = true;
    }

  return &priv->flexspi;
}

#endif /* CONFIG_IMXRT_FLEXSPI */
